### Real Estate Price Prediction

In [205]:
# importing libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
plt.style.use('dark_background')

In [206]:
# importing data

df_fl = pd.read_csv('florida_homes.csv')
df_id = pd.read_csv('idaho_homes.csv')
df_vi = pd.read_csv('virginia homes.csv')

#### Data Exploration

In [207]:
df_fl.head()

,type,sub_type,text,status,year_built,year_renovated,soldOn,lot_sqft,sqft,stories,baths,baths_full_calc,beds,garage,listPrice,url
0,single_family,NaN,Charming Brick Home in Sought-After Wedgefield...,for_sale,1990.0,NaN,1990-11-01,10454.0,2507.0,2.0,3.0,2.0,3.0,2.0,450000.0,https://www.realtor.com/realestateandhomes-det...
1,single_family,NaN,Welcome to this beautifully refreshed 3-bedroo...,for_sale,1978.0,NaN,2003-08-29,87120.0,1145.0,1.0,2.0,2.0,3.0,NaN,235000.0,https://www.realtor.com/realestateandhomes-det...
2,single_family,NaN,Charming home is situated in the highly sought...,for_sale,2006.0,NaN,2017-06-21,7405.0,1319.0,1.0,2.0,2.0,2.0,1.0,154900.0,https://www.realtor.com/realestateandhomes-det...
3,single_family,NaN,"Foreclosure Auction Ends June 24, 2025 at 11:0...",for_sale,1962.0,NaN,2014-09-03,NaN,2633.0,1.0,2.0,2.0,4.0,2.0,200000.0,https://www.realtor.com/realestateandhomes-det...
4,single_family,NaN,"Nestled on 2 acres in the heart of San Mateo, ...",for_sale,1889.0,NaN,2016-09-16,87120.0,4624.0,3.0,9.0,6.0,7.0,2.0,399000.0,https://www.realtor.com/realestateandhomes-det...

In [208]:
df_fl.shape

(6572, 16)

In [209]:
df_fl.columns

Index(['type', 'sub_type', 'text', 'status', 'year_built', 'year_renovated',
       'soldOn', 'lot_sqft', 'sqft', 'stories', 'baths', 'baths_full_calc',
       'beds', 'garage', 'listPrice', 'url'],
      dtype='object')

In [210]:
df_fl.isnull().sum()

type                  0
sub_type           5713
text                 14
status                0
year_built          907
year_renovated     6572
soldOn             2154
lot_sqft           1189
sqft                482
stories             905
baths               254
baths_full_calc     440
beds                435
garage             1569
listPrice             9
url                   0
dtype: int64

In [211]:
df_id.head()

,type,sub_type,text,status,year_built,year_renovated,soldOn,lot_sqft,stories,baths,baths_full,baths_full_calc,beds,garage,listPrice,url
0,single_family,NaN,Although the home is likely a tear-down due to...,for_sale,1993.0,NaN,NaN,49223.0,1.0,3.0,3.0,3.0,3.0,2.0,324900.0,https://www.realtor.com/realestateandhomes-det...
1,single_family,NaN,Nestled on 2.25 serene acres just 45 minutes f...,for_sale,1996.0,NaN,2018-10-31,98010.0,2.0,5.0,2.0,2.0,4.0,2.0,575000.0,https://www.realtor.com/realestateandhomes-det...
2,single_family,NaN,Secret Garden on Bonners Ferry's S Hill- Quain...,for_sale,1903.0,NaN,2015-08-14,6098.0,2.0,1.0,1.0,1.0,2.0,1.0,325000.0,https://www.realtor.com/realestateandhomes-det...
3,single_family,NaN,Alpine Model is available in 4 elevations; mod...,ready_to_build,NaN,NaN,NaN,NaN,1.0,NaN,2.0,2.0,4.0,2.0,475000.0,https://www.realtor.com/realestateandhomes-det...
4,single_family,NaN,"Craftsman single level home with shop, guest a...",for_sale,2008.0,NaN,2003-10-02,101930.0,1.0,2.0,2.0,2.0,2.0,2.0,769000.0,https://www.realtor.com/realestateandhomes-det...

In [212]:
df_id.shape

(6573, 16)

In [213]:
df_id.columns

Index(['type', 'sub_type', 'text', 'status', 'year_built', 'year_renovated',
       'soldOn', 'lot_sqft', 'stories', 'baths', 'baths_full',
       'baths_full_calc', 'beds', 'garage', 'listPrice', 'url'],
      dtype='object')

In [214]:
df_id.isnull().sum()

type                  0
sub_type           6365
text                 31
status                0
year_built          917
year_renovated     6573
soldOn             3399
lot_sqft            279
stories            1314
baths                86
baths_full          736
baths_full_calc     723
beds                701
garage             1603
listPrice             1
url                   0
dtype: int64

In [215]:
df_vi.head()

,type,sub_type,text,status,year_built,year_renovated,soldOn,lot_sqft,sqft,stories,baths,baths_full,baths_full_calc,beds,garage_max,listPrice,garage_min,garage_type,url
0,single_family,NaN,"Welcome to this one-owner, brick split-level h...",for_sale,1987.0,NaN,NaN,27007.0,2237.0,3.0,3.0,2.0,2.0,3.0,NaN,299900.0,NaN,NaN,https://www.realtor.com/realestateandhomes-det...
1,single_family,NaN,Nestled in the lovely English Forest neighborh...,for_sale,1970.0,NaN,2013-09-19,10890.0,2504.0,1.0,2.0,2.0,2.0,3.0,NaN,249900.0,NaN,NaN,https://www.realtor.com/realestateandhomes-det...
2,single_family,NaN,Welcome home to this beautifully updated 3-bed...,for_sale,1988.0,NaN,NaN,217800.0,2441.0,1.0,2.0,2.0,2.0,3.0,NaN,377000.0,NaN,NaN,https://www.realtor.com/realestateandhomes-det...
3,single_family,NaN,ESTATE AUCTION!!!! AUCTION!!!! AUCTION!!!! Cas...,for_sale,1978.0,NaN,NaN,479160.0,2425.0,2.0,5.0,4.0,4.0,3.0,NaN,350000.0,NaN,NaN,https://www.realtor.com/realestateandhomes-det...
4,single_family,NaN,"One-of-a-kind artisan-style 3 bed, 3 bath home...",for_sale,2000.0,NaN,2023-08-28,78844.0,2208.0,1.0,3.0,3.0,3.0,3.0,NaN,349900.0,NaN,NaN,https://www.realtor.com/realestateandhomes-det...

In [216]:
df_vi.shape

(6307, 19)

In [217]:
df_vi.columns

Index(['type', 'sub_type', 'text', 'status', 'year_built', 'year_renovated',
       'soldOn', 'lot_sqft', 'sqft', 'stories', 'baths', 'baths_full',
       'baths_full_calc', 'beds', 'garage_max', 'listPrice', 'garage_min',
       'garage_type', 'url'],
      dtype='object')

In [218]:
df_vi.isnull().sum()

type                  2
sub_type           5686
text                 65
status                0
year_built          770
year_renovated     6307
soldOn             2440
lot_sqft            674
sqft                640
stories            1161
baths                86
baths_full          643
baths_full_calc     643
beds                584
garage_max         6307
listPrice            18
garage_min         6307
garage_type        6307
url                   0
dtype: int64

#### Data Preprocessing

In [219]:
# Feature selection

df_fl = df_fl[['type','status','year_built','soldOn','lot_sqft','stories','baths','beds','listPrice']]
df_id = df_id[['type','status','year_built','soldOn','lot_sqft','stories','baths','beds','listPrice']]
df_vi = df_vi[['type','status','year_built','soldOn','lot_sqft','stories','baths','beds','listPrice']]

df_fl['state'] = 'Florida'
df_id['state'] = 'Idaho'
df_vi['state'] = 'Virginia'

df_fl.head()

,type,status,year_built,soldOn,lot_sqft,stories,baths,beds,listPrice,state
0,single_family,for_sale,1990.0,1990-11-01,10454.0,2.0,3.0,3.0,450000.0,Florida
1,single_family,for_sale,1978.0,2003-08-29,87120.0,1.0,2.0,3.0,235000.0,Florida
2,single_family,for_sale,2006.0,2017-06-21,7405.0,1.0,2.0,2.0,154900.0,Florida
3,single_family,for_sale,1962.0,2014-09-03,NaN,1.0,2.0,4.0,200000.0,Florida
4,single_family,for_sale,1889.0,2016-09-16,87120.0,3.0,9.0,7.0,399000.0,Florida

In [220]:
df_id.head()

,type,status,year_built,soldOn,lot_sqft,stories,baths,beds,listPrice,state
0,single_family,for_sale,1993.0,NaN,49223.0,1.0,3.0,3.0,324900.0,Idaho
1,single_family,for_sale,1996.0,2018-10-31,98010.0,2.0,5.0,4.0,575000.0,Idaho
2,single_family,for_sale,1903.0,2015-08-14,6098.0,2.0,1.0,2.0,325000.0,Idaho
3,single_family,ready_to_build,NaN,NaN,NaN,1.0,NaN,4.0,475000.0,Idaho
4,single_family,for_sale,2008.0,2003-10-02,101930.0,1.0,2.0,2.0,769000.0,Idaho

In [221]:
df_vi.head()

,type,status,year_built,soldOn,lot_sqft,stories,baths,beds,listPrice,state
0,single_family,for_sale,1987.0,NaN,27007.0,3.0,3.0,3.0,299900.0,Virginia
1,single_family,for_sale,1970.0,2013-09-19,10890.0,1.0,2.0,3.0,249900.0,Virginia
2,single_family,for_sale,1988.0,NaN,217800.0,1.0,2.0,3.0,377000.0,Virginia
3,single_family,for_sale,1978.0,NaN,479160.0,2.0,5.0,3.0,350000.0,Virginia
4,single_family,for_sale,2000.0,2023-08-28,78844.0,1.0,3.0,3.0,349900.0,Virginia

In [222]:
# concatinating 3 dataframes into one

df = pd.concat([df_vi,df_fl,df_id],axis=0)
df.head()

,type,status,year_built,soldOn,lot_sqft,stories,baths,beds,listPrice,state
0,single_family,for_sale,1987.0,NaN,27007.0,3.0,3.0,3.0,299900.0,Virginia
1,single_family,for_sale,1970.0,2013-09-19,10890.0,1.0,2.0,3.0,249900.0,Virginia
2,single_family,for_sale,1988.0,NaN,217800.0,1.0,2.0,3.0,377000.0,Virginia
3,single_family,for_sale,1978.0,NaN,479160.0,2.0,5.0,3.0,350000.0,Virginia
4,single_family,for_sale,2000.0,2023-08-28,78844.0,1.0,3.0,3.0,349900.0,Virginia

In [223]:
df.shape

(19452, 10)

In [224]:
df.dtypes

type           object
status         object
year_built    float64
soldOn         object
lot_sqft      float64
stories       float64
baths         float64
beds          float64
listPrice     float64
state          object
dtype: object

In [225]:
df.isnull().sum()

type             2
status           0
year_built    2594
soldOn        7993
lot_sqft      2142
stories       3380
baths          426
beds          1720
listPrice       28
state            0
dtype: int64

In [226]:
df.nunique()

type            12
status           2
year_built     205
soldOn        5030
lot_sqft      5158
stories         19
baths           24
beds            22
listPrice     3474
state            3
dtype: int64

In [227]:
df['type'].value_counts()

type
single_family                  15745
land                            1713
townhomes                       1003
condos                           725
multi_family                     134
farm                              73
condo_townhome                    26
townhouse                         13
condo_townhome_rowhome_coop       12
duplex_triplex                     3
condo                              2
apartment                          1
Name: count, dtype: int64

In [228]:
df['status'].value_counts()

status
for_sale          19053
ready_to_build      399
Name: count, dtype: int64

In [229]:
#filtering the dataset

df = df[df['status'] == 'for_sale']
df = df[df['type'] == 'single_family']

df.shape

(15389, 10)

In [230]:
df['soldOn'] = pd.to_datetime(df['soldOn'],dayfirst=True)
df.dtypes

C:\Users\ASUS\AppData\Local\Temp\ipykernel_16148\1688696545.py:1: UserWarning: Parsing dates in %Y-%m-%d format when dayfirst=True was specified. Pass `dayfirst=False` or specify a format to silence this warning.
  df['soldOn'] = pd.to_datetime(df['soldOn'],dayfirst=True)

type                  object
status                object
year_built           float64
soldOn        datetime64[ns]
lot_sqft             float64
stories              float64
baths                float64
beds                 float64
listPrice            float64
state                 object
dtype: object

In [231]:
print(f'Earliest Sold one date: {df['soldOn'].min()}')
print(f'Latest Sold one date: {df['soldOn'].max()}')

Earliest Sold one date: 1954-10-08 00:00:00
Latest Sold one date: 2025-05-30 00:00:00

In [232]:
df = df[(df['soldOn'] >= '2005-01-01') & (df['soldOn'] < '2025-05-30')]
df.shape

(8592, 10)

In [233]:
df.isnull().sum()

type            0
status          0
year_built     44
soldOn          0
lot_sqft      316
stories       561
baths           3
beds            0
listPrice       1
state           0
dtype: int64

In [234]:
# handling missing values and duplicales

df = df.dropna()
df = df.drop_duplicates()
df.shape

(7688, 10)

In [235]:
df = df.drop(['type','status'], axis=1) # dropping type and status columns as only one type of value was selected from both columns
df.head()

,year_built,soldOn,lot_sqft,stories,baths,beds,listPrice,state
1,1970.0,2013-09-19,10890.0,1.0,2.0,3.0,249900.0,Virginia
4,2000.0,2023-08-28,78844.0,1.0,3.0,3.0,349900.0,Virginia
7,1974.0,2018-09-07,27225.0,1.0,2.0,3.0,450000.0,Virginia
8,1830.0,2018-05-01,3265258.0,2.0,3.0,3.0,995000.0,Virginia
16,1991.0,2012-09-18,17293.0,2.0,2.0,4.0,380000.0,Virginia

#### Feature Engineering

In [236]:
# creating the feature of property_age

df['year_sold'] = df['soldOn'].dt.year.astype('float') # extracting only the year from the soldOn feature
df['property_age'] = df['year_sold'] - df['year_built']
df = df.drop(['year_built','year_sold','soldOn'],axis=1)
df.head()

     lot_sqft  stories  baths  beds  listPrice     state  property_age
1     10890.0      1.0    2.0   3.0   249900.0  Virginia          43.0
4     78844.0      1.0    3.0   3.0   349900.0  Virginia          23.0
7     27225.0      1.0    2.0   3.0   450000.0  Virginia          44.0
8   3265258.0      2.0    3.0   3.0   995000.0  Virginia         188.0
16    17293.0      2.0    2.0   4.0   380000.0  Virginia          21.0

In [237]:
# creating price_per_lotsqft feature

df =df[df['lot_sqft'] != 0]
df['price_per_lotsqft'] = df['listPrice']/df['lot_sqft']
df.head()

,lot_sqft,stories,baths,beds,listPrice,state,property_age,price_per_lotsqft
1,10890.0,1.0,2.0,3.0,249900.0,Virginia,43.0,22.947658
4,78844.0,1.0,3.0,3.0,349900.0,Virginia,23.0,4.437877
7,27225.0,1.0,2.0,3.0,450000.0,Virginia,44.0,16.528926
8,3265258.0,2.0,3.0,3.0,995000.0,Virginia,188.0,0.304723
16,17293.0,2.0,2.0,4.0,380000.0,Virginia,21.0,21.974209

In [239]:
df['price_per_lotsqft'].min()

3.904221634853767e-06

In [240]:
df['price_per_lotsqft'].max()

2207.180694526192

In [241]:
df['price_per_lotsqft'].mean()

56.6870283764914